; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_9 ?v3 ?v7)
             (pred_1 ?v6 ?v5)
             (pred_12 ?v3 ?v5)
             (pred_6 ?v13 ?v3 )
	     (pred_10 ?v3)
             (pred_8 ?v8)
             (pred_5 ?v6)
             (pred_2 ?v5)
             (pred_4 ?v3)
             (pred_7 ?v6)
             (pred_11 ?v3)
             (pred_3 ))



(:action op_2
:parameters (?v2 ?v11 ?v4 ?v1)
:precondition (and (pred_8 ?v2) (pred_8 ?v11) (pred_5 ?v4) (pred_2 ?v1)
          (pred_9 ?v2 ?v11) (pred_1 ?v4 ?v1)
                   (pred_12 ?v11 ?v1) (pred_10 ?v2) 
                   (pred_4 ?v11) (pred_7 ?v4))
:effect (and  (pred_11 ?v11) (not (pred_4 ?v11))))


(:action op_5
:parameters (?v2 ?v9)
:precondition (and (pred_8 ?v2) (pred_8 ?v9)
               (pred_10 ?v2) (pred_9 ?v2 ?v9) (pred_11 ?v9))
:effect (and (pred_10 ?v9) (not (pred_10 ?v2))))

(:action op_3
:parameters (?v2 ?v4)
:precondition (and (pred_8 ?v2) (pred_5 ?v4) 
                  (pred_10 ?v2) (pred_6 ?v4 ?v2) (pred_3 ))
:effect (and (pred_7 ?v4)
   (not (pred_6 ?v4 ?v2)) (not (pred_3 ))))


(:action op_4
:parameters (?v2 ?v12 ?v10)
:precondition (and (pred_8 ?v2) (pred_5 ?v12) (pred_5 ?v10)
                  (pred_10 ?v2) (pred_7 ?v10) (pred_6 ?v12 ?v2))
:effect (and (pred_7 ?v12) (pred_6 ?v10 ?v2)
        (not (pred_7 ?v10)) (not (pred_6 ?v12 ?v2))))

(:action op_1
:parameters (?v2 ?v4)
:precondition (and (pred_8 ?v2) (pred_5 ?v4) 
                  (pred_10 ?v2) (pred_7 ?v4))
:effect (and (pred_3 ) (pred_6 ?v4 ?v2) (not (pred_7 ?v4)))))

; problem
(define (problem grid-5-5-3-4-4)
    (:domain grid)
    (:objects
    obj_09 obj_11 obj_27 obj_06 obj_32 obj_12 obj_08 obj_07 obj_04 obj_25 obj_15 obj_19 obj_03 obj_20 obj_26 obj_29 obj_17 obj_13 obj_23 obj_01 obj_28 obj_24 obj_18 obj_31 obj_30
    obj_02 obj_05 obj_10
    obj_16 obj_14 obj_22 obj_21
    )

    (:init
       (pred_3)

       (pred_8 obj_09)
       (pred_8 obj_11)
       (pred_8 obj_27)
       (pred_8 obj_06)
       (pred_8 obj_32)
       (pred_8 obj_12)
       (pred_8 obj_08)
       (pred_8 obj_07)
       (pred_8 obj_04)
       (pred_8 obj_25)
       (pred_8 obj_15)
       (pred_8 obj_19)
       (pred_8 obj_03)
       (pred_8 obj_20)
       (pred_8 obj_26)
       (pred_8 obj_29)
       (pred_8 obj_17)
       (pred_8 obj_13)
       (pred_8 obj_23)
       (pred_8 obj_01)
       (pred_8 obj_28)
       (pred_8 obj_24)
       (pred_8 obj_18)
       (pred_8 obj_31)
       (pred_8 obj_30)
       (pred_2 obj_02)
       (pred_2 obj_05)
       (pred_2 obj_10)
       (pred_5 obj_16)
       (pred_5 obj_14)
       (pred_5 obj_22)
       (pred_5 obj_21)

       (pred_9 obj_09 obj_12)
       (pred_9 obj_09 obj_11)
       (pred_9 obj_11 obj_08)
       (pred_9 obj_11 obj_27)
       (pred_9 obj_11 obj_09)
       (pred_9 obj_27 obj_07)
       (pred_9 obj_27 obj_06)
       (pred_9 obj_27 obj_11)
       (pred_9 obj_06 obj_04)
       (pred_9 obj_06 obj_32)
       (pred_9 obj_06 obj_27)
       (pred_9 obj_32 obj_25)
       (pred_9 obj_32 obj_06)
       (pred_9 obj_12 obj_15)
       (pred_9 obj_12 obj_08)
       (pred_9 obj_12 obj_09)
       (pred_9 obj_08 obj_19)
       (pred_9 obj_08 obj_07)
       (pred_9 obj_08 obj_11)
       (pred_9 obj_08 obj_12)
       (pred_9 obj_07 obj_03)
       (pred_9 obj_07 obj_04)
       (pred_9 obj_07 obj_27)
       (pred_9 obj_07 obj_08)
       (pred_9 obj_04 obj_20)
       (pred_9 obj_04 obj_25)
       (pred_9 obj_04 obj_06)
       (pred_9 obj_04 obj_07)
       (pred_9 obj_25 obj_26)
       (pred_9 obj_25 obj_32)
       (pred_9 obj_25 obj_04)
       (pred_9 obj_15 obj_29)
       (pred_9 obj_15 obj_19)
       (pred_9 obj_15 obj_12)
       (pred_9 obj_19 obj_17)
       (pred_9 obj_19 obj_03)
       (pred_9 obj_19 obj_08)
       (pred_9 obj_19 obj_15)
       (pred_9 obj_03 obj_13)
       (pred_9 obj_03 obj_20)
       (pred_9 obj_03 obj_07)
       (pred_9 obj_03 obj_19)
       (pred_9 obj_20 obj_23)
       (pred_9 obj_20 obj_26)
       (pred_9 obj_20 obj_04)
       (pred_9 obj_20 obj_03)
       (pred_9 obj_26 obj_01)
       (pred_9 obj_26 obj_25)
       (pred_9 obj_26 obj_20)
       (pred_9 obj_29 obj_28)
       (pred_9 obj_29 obj_17)
       (pred_9 obj_29 obj_15)
       (pred_9 obj_17 obj_24)
       (pred_9 obj_17 obj_13)
       (pred_9 obj_17 obj_19)
       (pred_9 obj_17 obj_29)
       (pred_9 obj_13 obj_18)
       (pred_9 obj_13 obj_23)
       (pred_9 obj_13 obj_03)
       (pred_9 obj_13 obj_17)
       (pred_9 obj_23 obj_31)
       (pred_9 obj_23 obj_01)
       (pred_9 obj_23 obj_20)
       (pred_9 obj_23 obj_13)
       (pred_9 obj_01 obj_30)
       (pred_9 obj_01 obj_26)
       (pred_9 obj_01 obj_23)
       (pred_9 obj_28 obj_24)
       (pred_9 obj_28 obj_29)
       (pred_9 obj_24 obj_18)
       (pred_9 obj_24 obj_17)
       (pred_9 obj_24 obj_28)
       (pred_9 obj_18 obj_31)
       (pred_9 obj_18 obj_13)
       (pred_9 obj_18 obj_24)
       (pred_9 obj_31 obj_30)
       (pred_9 obj_31 obj_23)
       (pred_9 obj_31 obj_18)
       (pred_9 obj_30 obj_01)
       (pred_9 obj_30 obj_31)
       (pred_4 obj_27)
       (pred_4 obj_03)
       (pred_4 obj_12)
       (pred_4 obj_25)
       (pred_12  obj_27 obj_02)
       (pred_12  obj_03 obj_05)
       (pred_12  obj_12 obj_10)
       (pred_12  obj_25 obj_02)
       (pred_11 obj_09)
       (pred_11 obj_11)
       (pred_11 obj_06)
       (pred_11 obj_32)
       (pred_11 obj_08)
       (pred_11 obj_07)
       (pred_11 obj_04)
       (pred_11 obj_15)
       (pred_11 obj_19)
       (pred_11 obj_20)
       (pred_11 obj_26)
       (pred_11 obj_29)
       (pred_11 obj_17)
       (pred_11 obj_13)
       (pred_11 obj_23)
       (pred_11 obj_01)
       (pred_11 obj_28)
       (pred_11 obj_24)
       (pred_11 obj_18)
       (pred_11 obj_31)
       (pred_11 obj_30)

       (pred_1  obj_16 obj_02)
       (pred_1  obj_14 obj_05)
       (pred_1  obj_22 obj_10)
       (pred_1  obj_21 obj_02)
       (pred_6 obj_16 obj_24)
       (pred_6 obj_14 obj_11)
       (pred_6 obj_22 obj_24)
       (pred_6 obj_21 obj_31)
       (pred_10 obj_07)
    )

    (:goal (and
       (pred_6 obj_22 obj_30)
       (pred_6 obj_21 obj_24)
    ))
(:constraints
  (always (not (pred_10 obj_18)))
)
)

; plan
1. (op_5 obj_07 obj_08)
   deleted: (pred_10 obj_07)
   added: (pred_10 obj_08)
   goals met: 0 of 2
2. (op_5 obj_08 obj_19)
   deleted: (pred_10 obj_08)
   added: (pred_10 obj_19)
   goals met: 0 of 2
3. (op_5 obj_19 obj_17)
   deleted: (pred_10 obj_19)
   added: (pred_10 obj_17)
   goals met: 0 of 2
4. (op_5 obj_17 obj_24)
   deleted: (pred_10 obj_17)
   added: (pred_10 obj_24)
   goals met: 0 of 2
5. (op_3 obj_24 obj_22)
   deleted: (pred_6 obj_22 obj_24) (pred_3)
   added: (pred_7 obj_22)
   goals met: 0 of 2
6. (op_5 obj_24 obj_17)
   deleted: (pred_10 obj_24)
   added: (pred_10 obj_17)
   goals met: 0 of 2
7. (op_5 obj_17 obj_13)
   deleted: (pred_10 obj_17)
   added: (pred_10 obj_13)
   goals met: 0 of 2
8. (op_5 obj_13 obj_23)
   deleted: (pred_10 obj_13)
   added: (pred_10 obj_23)
   goals met: 0 of 2
9. (op_5 obj_23 obj_31)
   deleted: (pred_10 obj_23)
   added: (pred_10 obj_31)
   goals met: 0 of 2
10. (op_5 obj_31 obj_30)
   deleted: (pred_10 obj_31)
   added: (pred_10 obj_30)
   goals met: 0 of 2
11. (op_1 obj_30 obj_22)
   deleted: (pred_7 obj_22)
   added: (pred_3) (pred_6 obj_22 obj_30)
   goals met: 1 of 2
12. (op_5 obj_30 obj_31)
   deleted: (pred_10 obj_30)
   added: (pred_10 obj_31)
   goals met: 1 of 2
13. (op_3 obj_31 obj_21)
   deleted: (pred_6 obj_21 obj_31) (pred_3)
   added: (pred_7 obj_21)
   goals met: 1 of 2
14. (op_5 obj_31 obj_23)
   deleted: (pred_10 obj_31)
   added: (pred_10 obj_23)
   goals met: 1 of 2
15. (op_5 obj_23 obj_13)
   deleted: (pred_10 obj_23)
   added: (pred_10 obj_13)
   goals met: 1 of 2
16. (op_5 obj_13 obj_17)
   deleted: (pred_10 obj_13)
   added: (pred_10 obj_17)
   goals met: 1 of 2
17. (op_5 obj_17 obj_24)
   deleted: (pred_10 obj_17)
   added: (pred_10 obj_24)
   goals met: 1 of 2
18. (op_4 obj_24 obj_16 obj_21)
   deleted: (pred_7 obj_21) (pred_6 obj_16 obj_24)
   added: (pred_7 obj_16) (pred_6 obj_21 obj_24)
   goals met: 2 of 2
